export type SurahDetails = {
  id: number;
  name: string;
  type: "مكية" | "مدنية";
  versesCount: number;
  verses: string[];
  versesTranslations?: {
    ru: string[];
  };
};

export const surahDetails: Record<string, SurahDetails> = {
  "1": {
    id: 1,
    name: "الفاتحة",
    type: "مكية",
    versesCount: 7,
    verses: [
      "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "الرَّحْمَٰنِ الرَّحِيمِ",
      "مَالِكِ يَوْمِ الدِّينِ",
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
      "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
    ],
    versesTranslations: {
      ru: [
        "Во имя Аллаха, Милостивого, Милосердного!",
        "Хвала Аллаху, Господу миров,",
        "Милостивому, Милосердному,",
        "Властелину Дня воздаяния!",
        "Тебе одному мы поклоняемся и Тебя одного молим о помощи.",
        "Веди нас прямым путем,",
        "путем тех, кого Ты облагодетельствовал, не тех, на кого пал гнев, и не заблудших."
      ]
    }
  },
  "2": {
    id: 2,
    name: "البقرة",
    type: "مدنية",
    versesCount: 5,
    verses: [
      "الم",
      "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ",
      "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ",
      "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ",
      "أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
    ],
    versesTranslations: {
      ru: [
        "Алиф. Лям. Мим.",
        "Это Писание, в котором нет сомнения, является верным руководством для богобоязненных,",
        "которые веруют в сокровенное, совершают намаз и расходуют из того, чем Мы их наделили,",
        "которые веруют в ниспосланное тебе и ниспосланное до тебя и убеждены в Последней жизни.",
        "Они следуют верному руководству от своего Господа, и они — преуспевшие."
      ]
    }
  },
};
